Repository: masinde70/Auction
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: You cannot delete someone else's auction.
sw: Huwezi ondoa isiyo yako

source: Your bid is too low. Outbid any previous bids and conform to the minimum bid.
sw: Ongeza pesa

source: Language
sw: Lugha

source: Log Out
sw: Toka

source: Sign Up
sw: Jiunge

source: About Page
sw: Kuhusu

source: Hi from %(site_name)s! You're receiving this e-mail because user %(user_display)s has given yours as an e-mail address to connect their account. To confirm this is correct, go to %(activate_url)s
sw: Habari kutoka kwetu %(site_name)s! Umepokea barua pepe %(user_display)s ameandika majina yako Thibitisha %(activate_url)s

source: Thank you from %(site_name)s! %(site_domain)s
sw: Asante sana %(site_name)s! %(site_domain)s

source: Confirm Your Sign Up
sw: Thibitisha Usajiri

source: Confirm E-mail Address
sw: Thibitisha Barua pepe

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
sw: Thibitisha <a href="mailto:%(email)s">%(email)s</a> in barua pepe mtumaji %(user_display)s.

source: Confirm
sw: Thibitsha

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
sw: Muda wa kuthibitisha umeisha tafadhari tuma upya <a href="%(email_url)s">Tuma upya maombi yako</a>.

source: Homepage
sw: Nyumbani

source: Create Auction
sw: Fanya mauzo

source: English
sw: Kiswahili

source: Swahili
sw: English
